import './App.css';
import { Layout } from './components/Layout';
import { Routes, Route } from 'react-router-dom';
import { Main } from './pages/Main.jsx';
import { About } from './pages/About';
//import { Vacancies } from './pages/Vacancies';
import { Services } from './pages/Services';
import { Contacts } from './pages/Contacts';
import { Reviews } from './pages/Reviews';
//import { JobList } from './pages/JobList';
//import { JobDetails } from './pages/JobDetails';
import { JobList } from './pages/JobList';
import { JobDetails } from './pages/JobDetails';

function App() {
   const jobs = [
      { 
         id: '1', 
         title: 'Deck Steward', 
         responsibilities: '<p>Оказывает содействие бармену, гарантируя, что на назначенных участках есть достаточный запас напитков, стеклянной посуды, льда и гарниров, выполняя поручения по уборке и ряд других необходимых заданий.</p><p>Поддерживает чистоту рабочей зоны бара и соблюдает надлежащую процедуру мойки и  чистки посуды, рабочего места, инвентаря, кладовых, полов, оборудования и т.д. Моет рабочие столы, стены, холодильники, оборудование и все остальные поверхности и стойки. Подметает и моет пол.</p>',
         requirements: '<p>Возраст: от 18 лет</p> <p>Один год предыдущего опыта работы, преимущественно в баре либо 6 месяцев в схожей позиции на круизном судне.</p> <p>Английский язык: разговорный уровень</p>',
         salary: 'фиксированная зарплата по контракту.',
         conditions: 'проживание, питание и медицинское страхование за счет работодателя.',
         schedule: '7 дней/неделю, 10 часов/день (смены).',
         expenses: 'оформление паспорта моряка и сертификатов по технике безопасности, прохождение медкомиссии, получение необходимых виз, покупка билета на самолет. Суммарные затраты зависят от маршрута/направления лайнера.',
         img: 'https://lh3.googleusercontent.com/pCR19vuhAKekOUdfqKRI-5dxSwdUERGQb4W-vjqm23uwpJFeYBsCDuuT2mT1gBbvxDdRRjrFWM3oeyU55vV2XRMZ_g=s0' 
      },
      { 
         id: '2', 
         title: 'Bar Waiter (официант)', 
         responsibilities: '<p>Обеспечивает эффективную и бесперебойную доставку всех блюд и напитков гостям в их каюты.</p> <p>Владеет описаниями меню, ингредиентами и картами вин, чтобы соответствующим образом обсудить вопросы с гостями.</p> <p>Получает белье, столовое серебро, стеклянную посуду и фарфор для оборудования подносов для кают.</p> <p>Приветствует гостей при доставке заказа в номер. При доставке в каюты следует всем установленным процедурам безопасности и конфиденциальности гостей. Наблюдает за гостями, чтобы предугадать их потребности и удовлетворить их дополнительные запросы.</p> <p>Передает заказы на кухню по мере необходимости и доставляет блюда с кухни и напитки из разных мест.</p> <p>Возвращает подносы в кладовую и очищает посуду и подносы, помещает посуду в посудомоечную машину и выбрасывает мусор. Поддерживает чистоту рабочих зон и следит за надлежащей мойкой и санитарными условиями, оборудованием, посудой, бокалами, столовыми приборами и т.д. Всегда использует надлежащие санитарные нормы USPH и практикует бережное обращение со всем оборудованием кухни, чтобы избежать повреждения в результате небрежного обращения.</p>',
         requirements: '<p>Возраст: от 18 лет</p> <p>Два-три года опыта работы официантом бара, предпочтительно в ресторане 4-5 *, отеле и т. д.</p> <p>Знание различных марок и качества ликеров, пива и вин.</p> <p>Знание кассовых аппаратов и/или связанных с ними компьютерных систем.</p> <p>Дополнительные знания языков: немецкий, итальянский, французский, испанский и т.д.</p> <p>Английский язык: разговорный уровень.</p>',
         salary: 'фиксированная зарплата по контракту.',
         conditions: 'проживание, питание и медицинское страхование за счет работодателя.',
         schedule: '7 дней/неделю, 10 часов/день (смены).',
         expenses: 'оформление паспорта моряка и сертификатов по технике безопасности, прохождение медкомиссии, получение необходимых виз, покупка билета на самолет. Суммарные затраты зависят от маршрута/направления лайнера.',
         img: 'https://kh-news.net/images/stories/oleg/chto-dolzhen-znat-oficiant-restorana/1chto-dolzhen-znat-oficiant-restorana.jpg' 
      },
      { 
         id: '3', 
         title: 'Steward (стюард)', 
         responsibilities: '<p>Обеспечивает эффективную и бесперебойную доставку всех блюд и напитков гостям в их каюты.</p> <p>Владеет описаниями меню, ингредиентами и картами вин, чтобы соответствующим образом обсудить вопросы с гостями.</p> <p>Получает белье, столовое серебро, стеклянную посуду и фарфор для оборудования подносов для кают.</p> <p>Приветствует гостей при доставке заказа в номер. При доставке в каюты следует всем установленным процедурам безопасности и конфиденциальности гостей. Наблюдает за гостями, чтобы предугадать их потребности и удовлетворить их дополнительные запросы.</p> <p>Передает заказы на кухню по мере необходимости и доставляет блюда с кухни и напитки из разных мест.</p> <p>Возвращает подносы в кладовую и очищает посуду и подносы, помещает посуду в посудомоечную машину и выбрасывает мусор. Поддерживает чистоту рабочих зон и следит за надлежащей мойкой и санитарными условиями, оборудованием, посудой, бокалами, столовыми приборами и т.д. Всегда использует надлежащие санитарные нормы USPH и практикует бережное обращение со всем оборудованием кухни, чтобы избежать повреждения в результате небрежного обращения.</p>',
         requirements: '<p>Возраст: от 21 года.</p> <p>Опыт работы от одного до двух лет в сфере обслуживания продуктов либо на кухне предпочтительно в высококлассном отеле, на курорте или круизной линии (предпочтение отдается судовому опыту работы).</p> <p>Знание стандартов общественного здравоохранения.</p>  <p>Английский язык: разговорный уровень</p> <p>Дополнительные знания языков: немецкий, итальянский, французский, испанский и т.д.</p>',
         salary: 'фиксированная зарплата по контракту.',
         conditions: 'проживание, питание и медицинское страхование за счет работодателя.',
         schedule: '7 дней/неделю, 10 часов/день (смены).',
         expenses: 'оформление паспорта моряка и сертификатов по технике безопасности, прохождение медкомиссии, получение необходимых виз, покупка билета на самолет. Суммарные затраты зависят от маршрута/направления лайнера.',
         img: 'https://layboard.com/images/uploads/50868/main_cruise-ship.qm0rkj.jpg' 
      },
      { 
         id: '4', 
         title: 'Горничная', 
         responsibilities: '<p>Поддерживает назначенную секцию от 10 до 21 гостевых кают (и при наличии, балконов), ледовых станций, подсобных помещений, тележек и коридоров в чистоте и порядке.</p> <p>Встречает гостей у главного входа во время посадки. Сопровождает гостей и несет ручную кладь в каюты.</p> <p>Выполняет все ежедневные, еженедельные и ежемесячные процедуры уборки каюты и коридора.</p> <p>Заправляет кровати и меняет полотенца. Чистит ванные и заменяет расходные материалы ванной комнаты. Чистит душ, раковины и унитаз.</p> <p>Чистит ковер, обивку, полы, стены, потолки, драпировки, окна и предметы интерьера помещений, чтобы устранить последствия воздействия дыма, воды и других повреждения, такие как грязь, сажа, пятна, плесень, а также избыток воды и влаги. Подметает, чистит и пылесосит пол. Очищает ковры, обивки и ткани с помощью спреев, кондиционеров, дезодорантов и дезинфицирующих средств.</p> <p>Удаляет пыль с мебели, моет окна, стены, потолки, изделия из дерева и дверные панели.</p> <p>Опорожняет и очищает мусорные корзины и пепельницы. Разделяет и помещает мусор в специальные контейнеры.</p> <p>Получает от гостей вещи для стирки и химчистки и доставляет ее в прачечную для обработки. Возвращает вычищенное белье в гостевую каюту и представляет счета за стирку.</p> <p>Сортирует, считает, складывает, маркирует и переносит белье.</p> <p>Уведомляет руководство о неисправности осветительного, отопительного и вентиляционного оборудования.</p> <p>Поддерживает чистящие средства и оборудование в хорошем рабочем состоянии. Заказывает расходные материалы и оборудование при необходимости.</p> <p>Транспортирует багаж гостя в назначенные места при посадке и отъезде.</p>',
         requirements: '<p>Возраст: от 18 лет</p> <p>Минимум один-два года предыдущего опыта работы в уборке, предпочтительно в отеле 4-5* или соответствующий опыт на аналогичной должности на круизных лайнерах.</p> <p>Знание соответствующих методов уборки, требований и использования оборудования.</p> <p>Знания в химической обработке.</p> <p>Английский язык: разговорный уровень.</p> <p>Дополнительные знания языков: немецкий, итальянский, французский, испанский и т.д.</p>',
         salary: 'фиксированная зарплата по контракту.',
         conditions: 'проживание, питание и медицинское страхование за счет работодателя.',
         schedule: '7 дней/неделю, 10 часов/день (смены).',
         expenses: 'оформление паспорта моряка и сертификатов по технике безопасности, прохождение медкомиссии, получение необходимых виз, покупка билета на самолет. Суммарные затраты зависят от маршрута/направления лайнера.',
         img: 'https://profitworks.com.ua/images/img/Turism-service/Gornichnaya.jpg' 
      },
      { 
         id: '5', 
         title: 'Cleaner (уборщик)', 
         responsibilities: '<p>Использует паровое оборудование, скребки, метлы и различные ручные и электроинструменты. Использует различные чистящие средства и химические вещества в зависимости от потребностей очистки.</p><p>Смешивает воду и моющие средства в контейнере для приготовления чистящих растворов в соответствии со спецификой.</p> <p>Чистит общественные туалетные комнаты, лифты, офисы и коридоры экипажа.</p> <p>Очищает ковер, обивку, полы, стены, потолки, драпировки, окна и аксессуары для помещений, чтобы устранить воздействие дыма, воды и других повреждений, таких как грязь, сажа, пятна, плесень, а также избыток воды и влаги.</p> <p>Очищает ковры, обивки и ткани с помощью спреев, кондиционеров, дезодорантов и дезинфицирующих средств.</p> <p>Удаляет пыль с мебели, моет окна, стены, потолки, изделия из дерева и дверные панели.</p> <p>Полирует латунь и другие металлические приспособления.</p> <p>Поддерживает чистящие средства и оборудование в хорошем рабочем состоянии. При необходимости дает рекомендации по реквизиции материалов и оборудования.</p> <p>Помогать работникам общественного питания в сборе грязных стаканов, фарфора, столовых приборов и т. д. по всему судну. Транспортирует в специально отведенные места сбора.</p> <p>Опорожняет и очищает мусорные корзины и пепельницы и вывозит мусор в зону утилизации.</p> <p>Транспортирует багаж гостей в назначенные места во время посадки и высадки.</p> <p>Помогает с обработкой и погрузкой на судовые склады в дни погрузки согласно расписанию.</p>',
         requirements: '<p>Возраст: от 18 лет</p> <p>Один год предыдущего опыта работы, преимущественно в баре либо 6 месяцев в схожей позиции на круизном судне.</p> <p>Знание соответствующих методов уборки, требований и использования оборудования</p> <p>Знания в химической обработке</p> <p>Английский язык: разговорный уровень</p> <p>Дополнительные знания языков: немецкий, итальянский, французский, испанский и т.д.</p>',
         salary: 'фиксированная зарплата по контракту.',
         conditions: 'проживание, питание и медицинское страхование за счет работодателя.',
         schedule: '7 дней/неделю, 10 часов/день (смены).',
         expenses: 'оформление паспорта моряка и сертификатов по технике безопасности, прохождение медкомиссии, получение необходимых виз, покупка билета на самолет. Суммарные затраты зависят от маршрута/направления лайнера.',
         img: 'https://polsha24.com/media/News/yborshik.jpg' 
      },
   ];



   return (
      <Layout>
         <Routes>
            <Route path='/' element={<Main/>} />
            <Route path='/about' element={<About/>} />
            <Route path='/services' element={<Services/>} />
            <Route path='/jobs' element={<JobList jobs={jobs}/>} />
            <Route path="/jobs/:id" element={<JobDetails jobs={jobs} />} />
            <Route path='/contacts' element={<Contacts/>} />
            <Route path='/reviews' element={<Reviews/>} />
            
         </Routes>
      </Layout>
   );
}

export default App;
